package com.mgiandia.library.dao;


import java.util.List;

import com.mgiandia.library.domain.Loan;

/**
 * Η διεπαφή DAO για την κλάση {@link Loan}.
 * @author Νίκος Διαμαντίδης
 *
 */
public interface LoanDAO {
    /**
     * Επιστρέφει το δανεισμό για κάποιο αριθμό εισαγωγής.
     * @param uid Ο αριθμός εισαγωγής του δανεισμού
     * @return Ο δανεισμός
     */
    Loan find(int uid);

    /**
     * Επιστρέφει το δανεισμό σε εκκρεμότητα για κάποιο αριθμό
     * εισαγωγής αντιτύπου. Αν δεν υπάρχει δανεισμός σε
     * εκκρεμότητα επιστρέφει {@code null}.
     * @param itemNo Ο αριθμός εισαγωγής του αντιτύπου
     * @return Ο δανεισμός που είναι σε εκκρεμότητα.
     */
    Loan findPending(int itemNo);

    /**
     * Επιστρέφει όλους τους εκκρεμείς δανεισμούς.
     * @return Ο κατάλογος των εκκρεμών δανεισμών
     */
    List<Loan> findAllPending();
    
    
    /**
     * Αποθηκεύει ένα αντικείμενο στην εξωτερική πηγή
     * δεδομένων. Το αντικείμενο μπορεί να είναι κάποιο
     * νέο αντικείμενο που δεν υπάρχει στην πηγή δεδομένων
     * ή κάποιο το οποίο ήδη υπάρχει και ενημερώνεται η
     * κατάστασή του.
     * @param entity Το αντικείμενο του οποίου η κατάσταση
     * αποθηκεύεται στην εξωτερική πηγή δεδομένων.
     */
    void save(Loan entity);
    
    /**
     * Διαγράφει το αντικείμενο από την εξωτερική πηγή δεδομένων.
     * @param entity Το αντικείμενο προς διαγραφή.
     */
    void delete(Loan entity);
    
    /**
     * Επιστρέφει όλα τα αντικείμενα  από την εξωτερική πηγή δεδομένων.
     * @return Ο κατάλογος των αντικειμένων
     */
    List<Loan> findAll();

    /*
     * Επιστρέφει τον επόμενο διαθέσιμο κωδικό που μπορεί να χρησιμοποιηθεί από ένα δανεισμό.
     * @return Ο επόμενος διαθέσιμος κωδικός δανεισμού.
     */
    int nextId();
}
